<a href="https://colab.research.google.com/github/Sabertooth14/APP-lab/blob/main/Untitled7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import sqlite3
con = sqlite3.connect('Employees db')
c=con.cursor()
c.execute("Create table if not exists student(employee_ID int, First_Name text,Last_Name text,email text,phone int,hire_date date,job_id int,salary int,comission int,manager_id int,dept_id int)")
c.execute("Insert into student values(1,'Pranav','Karukayil','pk@gmil.com',384739299,12-1-23,1,30000,12000,2,3)")
c.execute("Insert into student values(2,'Darsh','Sanklehca','ds@gmail.com',672634848,13-2-23,2,27000,10000,3,1)")
c.execute("Insert into student values(3,'Aditi','Tripathi','at@yahoo.com',346538299,14-3-23,3,16500,9000,1,3)")
c.execute("Insert into student values(4,'Sanskar','Maheshwari','sm@hotmail.com',87631093,15-4-23,4,22800,10000,3,2)")
c.execute("Insert into student values(5,'Arunima','Karukayil','ak@hotmail.com',90382625,16-5-23,5,25000,11000,2,1)")
c.execute("Insert into student values(6,'Mihihr','Ghanekar','mk@yahoo.com',546281913,17-6-23,6,33000,11500,1,2)")
c.execute("Select * from student")
con.commit()
a = c.fetchall()
for i in a:
  print(i)

(1, 'Pranav', 'Karukayil', 'pk@gmil.com', 384739299, -12, 1, 30000, 12000, 2, 3)
(2, 'Darsh', 'Sanklehca', 'ds@gmail.com', 672634848, -12, 2, 27000, 10000, 3, 1)
(3, 'Aditi', 'Tripathi', 'at@yahoo.com', 346538299, -12, 3, 16500, 9000, 1, 3)
(4, 'Sanskar', 'Maheshwari', 'sm@hotmail.com', 87631093, -12, 4, 22800, 10000, 3, 2)
(5, 'Arunima', 'Karukayil', 'ak@hotmail.com', 90382625, -12, 5, 25000, 11000, 2, 1)
(6, 'Mihihr', 'Ghanekar', 'mk@yahoo.com', 546281913, -12, 6, 33000, 11500, 1, 2)

In [3]:

c.execute("SELECT first_name,last_name FROM student WHERE salary>25000")
con.commit()
a=c.fetchall()
for i in a:
  print(i)

('Pranav', 'Karukayil')
('Darsh', 'Sanklehca')
('Mihihr', 'Ghanekar')

In [9]:
c.execute("Create table if not exists table1(Reg_no int,name text,sex text)")
c.execute("Insert into table1 values(186,'Pranav','Male')")
c.execute("Insert into table1 values(202,'Darsh','Male')")
c.execute("Insert into table1 values(193,'Aditi','Female')")
c.execute("Create table if not exists table2(dept_no int,dept_name text)")
c.execute("Insert into table2 values(3,'CSE-AI ML')")
c.execute("Insert into table2 values(1,'ECE')")
c.execute("Insert into table2 values(2,'Biotech')")
c.execute("Select * from table1,table2")
con.commit()
a=c.fetchall()
for i in a:
  print(i)

(186, 'Pranav', 'Male', 3, 'CSE-AI ML')
(186, 'Pranav', 'Male', 1, 'ECE')
(186, 'Pranav', 'Male', 2, 'Biotech')
(202, 'Darsh', 'Male', 3, 'CSE-AI ML')
(202, 'Darsh', 'Male', 1, 'ECE')
(202, 'Darsh', 'Male', 2, 'Biotech')
(193, 'Aditi', 'Female', 3, 'CSE-AI ML')
(193, 'Aditi', 'Female', 1, 'ECE')
(193, 'Aditi', 'Female', 2, 'Biotech')
(186, 'Pranav', 'Male', 3, 'CSE-AI ML')
(186, 'Pranav', 'Male', 1, 'ECE')
(186, 'Pranav', 'Male', 2, 'Biotech')
(202, 'Darsh', 'Male', 3, 'CSE-AI ML')
(202, 'Darsh', 'Male', 1, 'ECE')
(202, 'Darsh', 'Male', 2, 'Biotech')
(193, 'Aditi', 'Female', 3, 'CSE-AI ML')
(193, 'Aditi', 'Female', 1, 'ECE')
(193, 'Aditi', 'Female', 2, 'Biotech')

In [11]:
c.execute("SELECT name FROM table1 WHERE sex='Female'")
con.commit()
print(c.fetchall())

[('Aditi',), ('Aditi',)]

In [12]:
c.execute("SELECT * FROM table1 ORDER BY Reg_no")
a = c.fetchall()
for i in a: 
  print(i)

(186, 'Pranav', 'Male')
(186, 'Pranav', 'Male')
(193, 'Aditi', 'Female')
(193, 'Aditi', 'Female')
(202, 'Darsh', 'Male')
(202, 'Darsh', 'Male')

In [18]:
c.execute("Create table if not exists movies(id int,name text, genre text,language text,rating int)")
c.execute("Insert into movies values(101,'Conjouring','Horror','English',3)")
c.execute("Insert into movies values(102,'Cars','Animated','English',2)")
c.execute("Insert into movies values(103,'Inception','Sci-fi','English',4)")
c.execute("Insert into movies values(104,'Interstellar','Sci-fi','English',5)")
c.execute("Insert into movies values(105,'Dont Breathe','Thriller','English',3)")
c.execute("Insert into movies values(106,'Shutter Island','Thriller','English',5)")
c.execute("Select * from movies")
con.commit()
a = c.fetchall()
for i in a:
  print(i)

(101, 'Conjouring', 'Horror', 'English', 3)
(101, 'Conjouring', 'Horror', 'English', 3)
(102, 'Cars', 'Animated', 'English', 2)
(103, 'Inception', 'Sci-fi', 'English', 4)
(103, 'Interstellar', 'Sci-fi', 'English', 5)
(101, 'Conjouring', 'Horror', 'English', 3)
(102, 'Cars', 'Animated', 'English', 2)
(103, 'Inception', 'Sci-fi', 'English', 4)
(103, 'Interstellar', 'Sci-fi', 'English', 5)
(103, 'Dont Breathe', 'Thriller', 'English', 3)
(103, 'Shutter Island', 'Thriller', 'English', 5)
(101, 'Conjouring', 'Horror', 'English', 3)
(102, 'Cars', 'Animated', 'English', 2)
(103, 'Inception', 'Sci-fi', 'English', 4)
(104, 'Interstellar', 'Sci-fi', 'English', 5)
(105, 'Dont Breathe', 'Thriller', 'English', 3)
(106, 'Shutter Island', 'Thriller', 'English', 5)

In [19]:
c.execute("Select * FROM movies WHERE rating>3")
con.commit()
a = c.fetchall()
for i in a:
  print(i)

(103, 'Inception', 'Sci-fi', 'English', 4)
(103, 'Interstellar', 'Sci-fi', 'English', 5)
(103, 'Inception', 'Sci-fi', 'English', 4)
(103, 'Interstellar', 'Sci-fi', 'English', 5)
(103, 'Shutter Island', 'Thriller', 'English', 5)
(103, 'Inception', 'Sci-fi', 'English', 4)
(104, 'Interstellar', 'Sci-fi', 'English', 5)
(106, 'Shutter Island', 'Thriller', 'English', 5)

In [20]:
c.execute("DELETE FROM movies WHERE id=102")
con.commit()
print(c.fetchall())

[]

In [ ]:
c.execute("UPDATE")